In [1]:
print("This is a simple Python program")

This is a simple Python program

In [2]:
print(" * ")
print(" *** ")
print(" ***** ")
print(" * ")
print(" * ")
print(" * ")

 *
 ***
 *****
 *
 *
 *

In [3]:
print("   * ")
print("  *** ")
print(" ***** ")
print("   * ")
print("   * ")
print("   * ")

   *
  ***
 *****
   *
   *
   *

In [4]:
print(4)

4

In [5]:
4

4

In [6]:
1+2+3+4

10

In [7]:
print(1+2+3+4)

10

In [8]:
'5345' + '53454'

'534553454'

In [10]:
x = 10
print(x)

10

In [2]:
import pandas as pd

In [6]:
import numpy as np

In [7]:
import matplotlib.pyplot as plt

In [16]:
s = pd.Series([1,3,5,np.nan,6,8])

In [17]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20180101', periods=6)

In [4]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2018-01-01  0.695818 -0.688847  0.212988  0.892137
2018-01-02 -0.793684  0.697108 -1.023754 -0.518879
2018-01-03 -1.079494  0.755781  0.354604  1.180348
2018-01-04  0.157734 -0.372342  0.088264  0.836883
2018-01-05  0.824907 -0.113231  0.698860  2.202172
2018-01-06 -0.378856 -0.005346 -0.475789  0.816333

In [22]:
df2 = pd.DataFrame({ 'A' : 1.,
                      'B' : pd.Timestamp('20130102'),
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"]),
                      'F' : 'foo' })

In [23]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [24]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-25-915637deb483>, line 1)

In [26]:
df2.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [27]:
df.head

<bound method NDFrame.head of                    A         B         C         D
2013-01-01  2.067071 -0.454789  0.780503  0.593074
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897
2013-01-04 -0.160863 -0.522493 -0.429118  0.059678
2013-01-05 -0.124556 -0.355860  0.328253  1.508838
2013-01-06 -1.238269 -0.440238  1.007084  1.103667>

In [28]:
df.head()

                   A         B         C         D
2013-01-01  2.067071 -0.454789  0.780503  0.593074
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897
2013-01-04 -0.160863 -0.522493 -0.429118  0.059678
2013-01-05 -0.124556 -0.355860  0.328253  1.508838

In [29]:
df.tail()

                   A         B         C         D
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897
2013-01-04 -0.160863 -0.522493 -0.429118  0.059678
2013-01-05 -0.124556 -0.355860  0.328253  1.508838
2013-01-06 -1.238269 -0.440238  1.007084  1.103667

In [30]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [33]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.669538  0.009993  0.026683  0.589956
std    1.663268  0.704347  0.834297  0.828767
min   -1.238269 -0.522493 -1.212724 -0.766897
25%   -0.151786 -0.451151 -0.400314  0.193027
50%    0.044547 -0.398049  0.007176  0.817224
75%    1.603716  0.589606  0.667440  1.088094
max    3.260193  0.928577  1.007084  1.508838

In [35]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.067071    0.213650    3.260193   -0.160863   -0.124556   -1.238269
B   -0.454789    0.904761    0.928577   -0.522493   -0.355860   -0.440238
C    0.780503   -0.313902   -1.212724   -0.429118    0.328253    1.007084
D    0.593074    1.041374   -0.766897    0.059678    1.508838    1.103667

In [1]:
df.sort_index(axis=1, ascending=False)

NameError: name 'df' is not defined

In [37]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.593074  0.780503 -0.454789  2.067071
2013-01-02  1.041374 -0.313902  0.904761  0.213650
2013-01-03 -0.766897 -1.212724  0.928577  3.260193
2013-01-04  0.059678 -0.429118 -0.522493 -0.160863
2013-01-05  1.508838  0.328253 -0.355860 -0.124556
2013-01-06  1.103667  1.007084 -0.440238 -1.238269

In [39]:
df['A']

2013-01-01    2.067071
2013-01-02    0.213650
2013-01-03    3.260193
2013-01-04   -0.160863
2013-01-05   -0.124556
2013-01-06   -1.238269
Freq: D, Name: A, dtype: float64

In [40]:
df[0:3]

                   A         B         C         D
2013-01-01  2.067071 -0.454789  0.780503  0.593074
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897

In [41]:
df.loc[dates[0]]

A    2.067071
B   -0.454789
C    0.780503
D    0.593074
Name: 2013-01-01 00:00:00, dtype: float64

In [42]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  2.067071 -0.454789
2013-01-02  0.213650  0.904761
2013-01-03  3.260193  0.928577
2013-01-04 -0.160863 -0.522493
2013-01-05 -0.124556 -0.355860
2013-01-06 -1.238269 -0.440238

In [43]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.213650  0.904761
2013-01-03  3.260193  0.928577
2013-01-04 -0.160863 -0.522493

In [45]:
df.loc['20130102',['A','B']]

A    0.213650
B    0.904761
Name: 2013-01-02 00:00:00, dtype: float64

In [47]:
df.loc[dates[0],'A']

2.06707134920289

In [48]:
df.at[dates[0],'A']

2.06707134920289

In [49]:
df.iloc[3]

A   -0.160863
B   -0.522493
C   -0.429118
D    0.059678
Name: 2013-01-04 00:00:00, dtype: float64

In [50]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.160863 -0.522493
2013-01-05 -0.124556 -0.355860

In [51]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.213650 -0.313902
2013-01-03  3.260193 -1.212724
2013-01-05 -0.124556  0.328253

In [52]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897

In [53]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.454789  0.780503
2013-01-02  0.904761 -0.313902
2013-01-03  0.928577 -1.212724
2013-01-04 -0.522493 -0.429118
2013-01-05 -0.355860  0.328253
2013-01-06 -0.440238  1.007084

In [54]:
df.iloc[1,1]

0.9047608474211121

In [55]:
df.iat[1,1]

0.9047608474211121

In [56]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.067071 -0.454789  0.780503  0.593074
2013-01-02  0.213650  0.904761 -0.313902  1.041374
2013-01-03  3.260193  0.928577 -1.212724 -0.766897

In [58]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.067071       NaN  0.780503  0.593074
2013-01-02  0.213650  0.904761       NaN  1.041374
2013-01-03  3.260193  0.928577       NaN       NaN
2013-01-04       NaN       NaN       NaN  0.059678
2013-01-05       NaN       NaN  0.328253  1.508838
2013-01-06       NaN       NaN  1.007084  1.103667

In [60]:
df2 = df.copy()

In [61]:
df2['E'] = ['one', 'one','two','three','four','three']

In [62]:
df2

                   A         B         C         D      E
2013-01-01  2.067071 -0.454789  0.780503  0.593074    one
2013-01-02  0.213650  0.904761 -0.313902  1.041374    one
2013-01-03  3.260193  0.928577 -1.212724 -0.766897    two
2013-01-04 -0.160863 -0.522493 -0.429118  0.059678  three
2013-01-05 -0.124556 -0.355860  0.328253  1.508838   four
2013-01-06 -1.238269 -0.440238  1.007084  1.103667  three

In [63]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  3.260193  0.928577 -1.212724 -0.766897   two
2013-01-05 -0.124556 -0.355860  0.328253  1.508838  four

In [64]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [65]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [67]:
df.at[dates[0],'A'] = 0

In [68]:
df.iat[0,1] = 0

In [69]:
df.loc[:,'D'] = np.array([5] * len(df))

In [70]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.780503  5
2013-01-02  0.213650  0.904761 -0.313902  5
2013-01-03  3.260193  0.928577 -1.212724  5
2013-01-04 -0.160863 -0.522493 -0.429118  5
2013-01-05 -0.124556 -0.355860  0.328253  5
2013-01-06 -1.238269 -0.440238  1.007084  5

In [71]:
df2 = df.copy()

In [72]:
df2[df2 > 0] = -df2

In [73]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.780503 -5
2013-01-02 -0.213650 -0.904761 -0.313902 -5
2013-01-03 -3.260193 -0.928577 -1.212724 -5
2013-01-04 -0.160863 -0.522493 -0.429118 -5
2013-01-05 -0.124556 -0.355860 -0.328253 -5
2013-01-06 -1.238269 -0.440238 -1.007084 -5

In [74]:
df.loc[:,'D'] = np.array([5] * len(df))

In [75]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.780503  5
2013-01-02  0.213650  0.904761 -0.313902  5
2013-01-03  3.260193  0.928577 -1.212724  5
2013-01-04 -0.160863 -0.522493 -0.429118  5
2013-01-05 -0.124556 -0.355860  0.328253  5
2013-01-06 -1.238269 -0.440238  1.007084  5

In [76]:
df['F'] = s1

In [77]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.780503  5  NaN
2013-01-02  0.213650  0.904761 -0.313902  5  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0
2013-01-05 -0.124556 -0.355860  0.328253  5  4.0
2013-01-06 -1.238269 -0.440238  1.007084  5  5.0

In [78]:
df.at[dates[0],'A'] = 0

In [79]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.780503  5  NaN
2013-01-02  0.213650  0.904761 -0.313902  5  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0
2013-01-05 -0.124556 -0.355860  0.328253  5  4.0
2013-01-06 -1.238269 -0.440238  1.007084  5  5.0

In [80]:
df.iat[0,1] = 0

In [81]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.780503  5  NaN
2013-01-02  0.213650  0.904761 -0.313902  5  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0
2013-01-05 -0.124556 -0.355860  0.328253  5  4.0
2013-01-06 -1.238269 -0.440238  1.007084  5  5.0

In [82]:
df.loc[:,'D'] = np.array([5] * len(df))

In [83]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.780503  5  NaN
2013-01-02  0.213650  0.904761 -0.313902  5  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0
2013-01-05 -0.124556 -0.355860  0.328253  5  4.0
2013-01-06 -1.238269 -0.440238  1.007084  5  5.0

In [84]:
df2 = df.copy()

In [85]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.780503  5  NaN
2013-01-02  0.213650  0.904761 -0.313902  5  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0
2013-01-05 -0.124556 -0.355860  0.328253  5  4.0
2013-01-06 -1.238269 -0.440238  1.007084  5  5.0

In [86]:
df2[df2 > 0] = -df2

In [88]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.780503 -5  NaN
2013-01-02 -0.213650 -0.904761 -0.313902 -5 -1.0
2013-01-03 -3.260193 -0.928577 -1.212724 -5 -2.0
2013-01-04 -0.160863 -0.522493 -0.429118 -5 -3.0
2013-01-05 -0.124556 -0.355860 -0.328253 -5 -4.0
2013-01-06 -1.238269 -0.440238 -1.007084 -5 -5.0

In [89]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [90]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [91]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.780503  5  NaN  1.0
2013-01-02  0.213650  0.904761 -0.313902  5  1.0  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0  NaN
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0  NaN

In [92]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02  0.21365  0.904761 -0.313902  5  1.0  1.0

In [94]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.780503  5  5.0  1.0
2013-01-02  0.213650  0.904761 -0.313902  5  1.0  1.0
2013-01-03  3.260193  0.928577 -1.212724  5  2.0  5.0
2013-01-04 -0.160863 -0.522493 -0.429118  5  3.0  5.0

In [95]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [96]:
df.mean()

A    0.325026
B    0.085791
C    0.026683
D    5.000000
F    3.000000
dtype: float64

In [97]:
df.mean(1)

2013-01-01    1.445126
2013-01-02    1.360902
2013-01-03    1.995209
2013-01-04    1.377505
2013-01-05    1.769567
2013-01-06    1.865715
Freq: D, dtype: float64

In [98]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [99]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [100]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  2.260193 -0.071423 -2.212724  4.0  1.0
2013-01-04 -3.160863 -3.522493 -3.429118  2.0  0.0
2013-01-05 -5.124556 -5.355860 -4.671747  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [101]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.780503   5   NaN
2013-01-02  0.213650  0.904761  0.466601  10   1.0
2013-01-03  3.473843  1.833338 -0.746123  15   3.0
2013-01-04  3.312980  1.310846 -1.175240  20   6.0
2013-01-05  3.188424  0.954985 -0.846988  25  10.0
2013-01-06  1.950155  0.514747  0.160096  30  15.0

In [102]:
df.apply(lambda x: x.max() - x.min())

A    4.498462
B    1.451070
C    2.219808
D    0.000000
F    4.000000
dtype: float64

In [103]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [104]:
s

0    2
1    0
2    5
3    5
4    6
5    6
6    3
7    5
8    2
9    6
dtype: int32

In [105]:
s.value_counts()

6    3
5    3
2    2
3    1
0    1
dtype: int64

In [106]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [107]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [108]:
age = input("enter your age")

enter your age12

In [109]:
print("your age is"age)

SyntaxError: invalid syntax (<ipython-input-109-edf34522978e>, line 1)

In [110]:
print("your age is",age)

your age is 12

In [111]:
print("YOU have", 65-age,"until retirement")

TypeError: unsupported operand type(s) for -: 'int' and 'str'

In [112]:
print "You have", 65 - age, "until retirement"

SyntaxError: Missing parentheses in call to 'print'. Did you mean print("You have", 65 - age, "until retirement")? (<ipython-input-112-7a34f7d05024>, line 1)

In [113]:
for x in range(1, 6):   print x, "squared is", x * x

SyntaxError: invalid syntax (<ipython-input-113-d8e07026c097>, line 1)

In [114]:
for x in range(1, 6):
 print x, "squared is", x * x

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(x, "squared is", x * x)? (<ipython-input-114-69b36f79fbbf>, line 2)

In [115]:
for x in range(1, 6):
print (x, "squared is", x * x)

IndentationError: expected an indented block (<ipython-input-115-79a26dc582f4>, line 2)

In [116]:
for x in range(1, 6):
    print(x, "squared is", x * x)

1 squared is 1
2 squared is 4
3 squared is 9
4 squared is 16
5 squared is 25

In [117]:
for x in range(1,6,-1)
print x
print "Blast off!"

SyntaxError: invalid syntax (<ipython-input-117-47f97abb953e>, line 1)

In [118]:
for x in range(1,6,-1):
print x
print "Blast off!"

IndentationError: expected an indented block (<ipython-input-118-1540c73d7f69>, line 2)

In [119]:
for x in range(1,6,-1)
print(x)
print "Blast off!"

SyntaxError: invalid syntax (<ipython-input-119-92fb4c74294a>, line 1)

In [121]:
for x in range(1, 6, -1):
print x
print("Blast off")

IndentationError: expected an indented block (<ipython-input-121-15f0ac643f9a>, line 2)

In [129]:
for x in range(6, 0, -1):
    print(x)
print("Blast off")

6
5
4
3
2
1
Blast off

In [132]:
sum = 0
for i in range(1, 11):
    sum = sum + (i * i)
    print("sum of first 10 squares is", sum)

sum of first 10 squares is 1
sum of first 10 squares is 5
sum of first 10 squares is 14
sum of first 10 squares is 30
sum of first 10 squares is 55
sum of first 10 squares is 91
sum of first 10 squares is 140
sum of first 10 squares is 204
sum of first 10 squares is 285
sum of first 10 squares is 385

In [133]:
sum = 0
for i in range(1, 11):
    sum = sum + (i * i)
print("sum of first 10 squares is", sum)

sum of first 10 squares is 385

In [134]:
gpa = 3.4
	if gpa > 2.0:
	    print "Your application is accepted."

IndentationError: unexpected indent (<ipython-input-134-cd6bd53076e1>, line 2)

In [135]:
gpa = 3.4
if gpa > 2.0:
    print "Your application is accepted."

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(int "Your application is accepted.")? (<ipython-input-135-eb65a2f988f0>, line 3)

In [136]:
gpa = 3.4
if gpa > 2.0:
    print("Your application is accepted.")

Your application is accepted.

In [137]:
gpa = 1.4
if gpa > 2.0:
    print("Welcome to Mars University!") 
else:
    print("Your application is denied.")

Your application is denied.

In [138]:
number = 1
while number < 200:
    print number, 
    number = number * 2

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(int number, end=" ")? (<ipython-input-138-06196ff4eacc>, line 3)

In [139]:
number = 1
while number < 200:
    print(number), 
    number = number * 2

1
2
4
8
16
32
64
128

In [140]:
name = "Martin Douglas Stepp"
length = len(name)
big_name = str.upper(name)
print(big_name, "has", length, "characters")

MARTIN DOUGLAS STEPP has 20 characters

In [142]:
name = raw_input("Howdy, pardner. What's yer name? ")
print(name, "... what a silly name!")

NameError: name 'raw_input' is not defined

In [2]:
print("Hello")

Hello

In [7]:
value = eval(input("Please enter an integer value in the range 0...10: "))
if value >= 0: # First check 
    if value <= 10: # Second check
        print("In range")
print("Done")

Please enter an integer value in the range 0...10: 2
In range
Done

In [10]:
entry = 0
sum = 0
print("Enter numbers to sum, negative number ends list:")
while entry >= 0: # A negative number exits the loop
    entry = eval(input()) # Get the value
    if entry >= 0: # Is number non-negative?
        sum += entry # Only add it if it is non-negative
    print("Sum =", sum) # Display the sum

Enter numbers to sum, negative number ends list:
1
Sum = 1
2
Sum = 3
3
Sum = 6
4
Sum = 10
-1
Sum = 10

In [2]:
print("This is a simple Python program")

This is a simple Python program

In [4]:
from math import sqrt

# Get value from the user
num = eval(input("Enter number: "))
# Compute the square root
root = sqrt(num);

# Report result
print("Square root of", num, "=", root)

Enter number: 17
Square root of 17 = 4.123105625617661